[
  {
    "id": "b1",
    "image": "images/atlasofemotion.jpg",
    "category": "art",
    "title": "Atlas of Emotion: Journeys in Art, Architecture, and Film",
    "author": "Giuliana Bruno",
    "description": "An award-winning cultural history of how we experience the world through art, film and architecture. Atlas of Emotion is a highly original endeavour to map a cultural history of spatio-visual arts. In an evocative montage of words and pictures, emphasises that “sight” and “site” but also “motion” and “emotion” are irrevocably connected. In so doing, Giuliana Bruno touches on the art of Gerhard Richter and Annette Message, the film making of Peter Greenaway and Michelangelo Antonioni, the origins of the movie palace and its precursors, and her own journeys to her native Naples. Visually luscious and daring in conception, Bruno opens new vistas and understandings at every turn.",
    "price": 48.5
  },
  {
    "id": "b2",
    "image": "images/emancipatedspectator.jpg",
    "category": "art",
    "title": "The Emancipated Spectator",
    "author": "Jacques Rancière",
    "description": "The foremost philosopher of art argues for a new politics of looking.\n\nThe theorists of art and film commonly depict the modern audience as aesthetically and politically passive.In response, both artists and thinkers have sought to transform the spectator into an active agent and the spectacle into a communal performance.\n\nIn this follow-up to the acclaimed The Future of the Image, Rancière takes a radically different approach to this attempted emancipation. First asking exactly what we mean by political art or the politics of art, he goes on to look at what the tradition of critical art, and the desire to insert art into life, has achieved. Has the militant critique of the consumption of images and commodities become, ironically, a sad affirmation of its omnipotence?",
    "price": 20
  },
  {
    "id": "b3",
    "image": "images/ashorthistoryofcahiersducinema.jpg",
    "category": "film",
    "title": "A Short History of 'Cahiers du Cinéma'",
    "author": "Emilie Bickerton",
    "description": "An unique account of cinema’s most influential journal\n\nCahiers du Cinéma was the single most influential project in the history of film.\n\nFounded in 1951, it was responsible for establishing film as the ‘seventh art,’ equal to literature, painting or music, and it revolutionized film-making and writing. Its contributors would put their words into action: the likes of Godard, Truffaut, Rivette, Rohmer were to become some of the greatest directors of the age, their films part of the internationally celebrated nouvelle vague.\n\nIn this authoritative new history, Emilie Bickerton explores the evolution and impact of Cahiers du Cinéma, from its early years, to its late-sixties radicalization, its internationalization, and its response to the television age of the seventies and eighties. Showing how the story of Cahiers continues to resonate with critics, practitioners and the film-going public, A Short History of Cahiers du Cinéma is a testimony to the extraordinary legacy and archive these ‘collected pages of a notebook’ have provided for the world of cinema.",
    "price": 25
  },
  {
    "id": "b4",
    "image": "images/desireunlimited.jpg",
    "category": "film",
    "title": "Desire Unlimited: The Cinema of Pedro Almodóvar",
    "author": "Paul Julian Smith",
    "description": "New and fully updated edition\n\nIn the last decade, Spanish film auteur Pedro Almodóvar has grown from critical darling of the film circuit scene to mainstream success. Frequently comic, often deadly serious, always visually glorious, his recent films range from the Oscar award–winning drama *Talk to Her* to the 2011 horror film *The Skin I Live In*. Though they are ambitious and varied, each is a distinctive innovation on the themes that have defined his work.\n\n*Desire Unlimited* is the classic film-by-film assessment of Almodóvar’s oeuvre, now updated to include his most recent work. Still the only study of its kind in English, it vigorously confirms its original argument, that beneath Almodóvar’s genius for comedy and visual pleasure lies a filmmaker whose work deserves to be taken with the utmost seriousness.",
    "price": 30
  },
  {
    "id": "b5",
    "image": "images/everythingyouwantedtoknowaboutlacan.jpg",
    "category": "film",
    "title": "Everything You Always Wanted to Know About Lacan (But Were Afraid to Ask Hitchcock)",
    "author": "Slavoj Žižek",
    "description": "Hitchcock gets onto the analyst’s couch in this extraordinary volume of case studies.\n\nThe contributors bring to bear an unrivaled enthusiasm and theoretical sweep on the entire Hitchcock oeuvre, analyzing movies such as *Rear Window* and *Psycho*. Starting from the premise that ‘everything has meaning,’ the authors examine the films’ ostensible narrative content and formal procedures to discover a rich proliferation of hidden ideological and psychic mechanisms. But Hitchcock is also a bait to lure the reader into a serious Marxist and Lacanian exploration of the construction of meaning.\n\nAn extraordinary landmark in Hitchcock studies, this new edition features a brand-new essay by philosopher Slavoj Žižek, presenter of Sophie Fiennes’s three-part documentary *The Pervert’s Guide to Cinema*.",
    "price": 30
  },
  {
    "id": "b6",
    "image": "images/filmandtheanarchistimagination.jpg",
    "category": "film",
    "title": "Film and the Anarchist Imagination",
    "author": "Richard Porton",
    "description": "Bearded bomb-throwers, self-indulgent nihilists, dangerous subversives—these characteristic clichés of anarchists in the popular imagination are often reproduced in the cinema. In this survey of anarchism in film, Richard Porton deconstructs such stereotypes while offering an account of films featuring anarchist characters and motifs.\n\nBearded bomb-throwers, self-indulgent nihilists, dangerous subversives—these characteristic clichés of anarchists in the popular imagination are often reproduced in the cinema. In *Film and the Anarchist Imagination*, the first comprehensive survey of anarchism in film, Richard Porton deconstructs such stereotypes while offering an authoritative account of films featuring anarchist characters and motifs.\n\nFrom the early cinema of Griffith and René Clair, to the work of Godard, Lina Wertmüller, Lizzie Borden, and Ken Loach, Porton analyzes portrayals of anarchism in film, presenting commentaries and critiques of such classics as *Zéro de Conduite*, *Tout Va Bien*, and *Love and Anarchy*. In addition, he provides an excellent guide to the complex traditions of anarchist thought, from Bakunin and Kropotkin to Emma Goldman and Murray Bookchin, disclosing a rich historical legacy that encompasses the Paris Commune, the Haymarket martyrs, the anarcho-syndicalists of the Spanish Civil War, as well as more familiar contemporary avatars like the Situationists and the enragés of May 1968.",
    "price": 25
  },
  {
    "id": "b7",
    "image": "images/magicalreels.jpg",
    "category": "film",
    "title": "Magical Reels: A History of Cinema in Latin America",
    "author": "John King",
    "description": "“An indispensable guide to the story so far.” —Times Literary Supplement\n\nStill the most comprehensive analysis of the subject to have appeared in English, *Magical Reels* charts the development of Latin American film industries in a world increasingly dominated by the advanced technology and massive distribution budgets of the North American mainstream.\n\nJohn King sets up a historical framework to unfold the overlapping histories of cinema in the continent: the itinerant film-makers of the silent era who projected their films in cafes and village halls, the inventive use of vernacular music and local comedy in early sound pictures, the “golden age” of 1940s Mexican cinema, and the “new cinema”—oppositional cinema made “with an idea in the head and a camera in the hand”—of the late 1950s and beyond.\n\nA country-by-country account of this new wave allows detailed discussion of, for instance, Peronist cinema in Argentina, 1960s’ revolutionary film-making in Cuba, state-sponsored cinema in 1970s’ Brazil and Venezuela, and the struggle for democratization in Chile in the 1980s.\n\nA new chapter written for this edition examines Latin American cinema of the 1990s, raising issues such as globalization, new cinema audiences, film funding and distribution.",
    "price": 25
  },
  {
    "id": "b8",
    "image": "images/shadesofnoir.jpg",
    "category": "film",
    "title": "Shades of Noir",
    "author": "Joan Copjec",
    "description": "Paris, summer 1946: this moment marks an important event in cinema history, not of production but of exhibition.\n\nFor this was the summer when, after the hiatus of the Second World War, French critics were again given the opportunity to view films from Hollywood. The films they saw, including *The Maltese Falcon*, *Double Indemnity*, *Laura*, *Murder, My Sweet*, and *The Woman in the Window*, prompted the naming and theorization of a new phenomenon: film noir.\n\nMuch of what has been written about the genre since has remained within the orbit of this preliminary assessment. While sympathetic towards the early French critics, this collection of original essays attempts to move beyond their first fascinated look. Beginning with an autonomy of that look—of the ‘poujadist' climate that nourished it and the imminent collapse of the Hollywood studio system that gave it its mournful inflection—*Shades of Noir* re-explores and calls into question the object first constructed by it. The impetus for this shift in perspective comes from the films themselves, viewed in the light of contemporary social and political concerns, and from new theoretical insights.\n\nSeveral contributions analyze the re-emergence of noir in recent years, most notably in the hybrid forms produced in the 1980s by the merging of noir with science fiction and horror, for example *Blade Runner* and *Angel Heart*, and in films by black directors such as *Deep Cover*, *Straight out of Brooklyn*, *A Rage in Harlem*, and *One False Move*. Other essays focus on the open urban territory in which the noir hero hides out; the office spaces in Chandler, and the palpable sense of waiting that fills empty warehouses, corridors, and hotel rooms.\n\nFinally, *Shades of Noir* pays renewed attention to the lethal relation between the sexes; to the femme fatale and the other women in noir. As the role of women expands, the femme fatale remains deadly, but her deadliness takes on new meanings.",
    "price": 30
  },
  {
    "id": "b9",
    "image": "images/theintervalsofcinema.jpg",
    "category": "film",
    "title": "The Intervals of Cinema",
    "author": "Jacques Rancière",
    "description": "An essential analysis of cinema from one of the great figures of French philosophy.\n\nThe cinema, like language, can be said to exist as a system of differences. In his latest book, the acclaimed philosopher Jacques Rancière relates cinema to literature and theatre. With literature, he argues, cinema takes its narrative conventions, while at the same time effacing its images and its philosophy; and it rejects theatre, while also fulfilling theatre’s dream. Built on these contradictions, the cinema is the real, material space in which one feels moved by the spectacle of shadows. Thus, for Rancière, the cinema is the always disappointed dream of a language of images.",
    "price": 20
  },
  {
    "id": "b10",
    "image": "images/womenandthenewgermancinema.jpg",
    "category": "film",
    "title": "Women and the New German Cinema",
    "author": "Julia Knight",
    "description": "There were virtually no women film directors in Germany until the 1970s. Today there are proportionally more than in any other film-making country, and their work has been extremely influential. Directors like Margarethe von Trotta, Helma Sanders-Brahms, Ulrike Ottinger, and Helke Sander have made a huge contribution to feminist film culture, but until now, critical consideration of New German Cinema in Britain and the United States has focused almost exclusively on male directors such as Rainer Werner Fassbinder and Wim Wenders.\n\nIn *Women and the New German Cinema*, Julia Knight examines how restrictive social, economic, and institutional conditions have compounded the neglect of the new women directors. Rejecting the traditional auteur approach, she explores the principal characteristics of women’s film-making in the 1970s and 1980s, in particular the role of the women’s movement, the concern with the notion of a ‘feminine aesthetic,’ women’s entry into the mainstream, and the emergence of a so-called post-feminist cinema.\n\nThis timely and comprehensive study will be essential reading for everyone concerned with contemporary cinema and feminism.",
    "price": 25
  },
  {
    "id": "b11",
    "image": "images/whiteriot.jpg",
    "category": "music",
    "title": "White Riot: Punk Rock and the Politics of Race",
    "author": "Stephen Duncombe and Maxwell Tremblay",
    "description": "The ultimate collection on punk and race, from the Clash to Los Crudos.\n\nFrom the Clash to Los Crudos, skinheads to afro-punks, the punk rock movement has been obsessed by race. And yet the connections have never been traced in a comprehensive way.\n*White Riot* is the definitive study of the subject, collecting first-person writing, lyrics, letters to zines, and analyses of punk history from across the globe. This book brings together writing from leading critics such as Greil Marcus and Dick Hebdige, personal reflections from punk pioneers such as Jimmy Pursey, Darryl Jenifer, and Mimi Nguyen, and reports on punk scenes from Toronto to Jakarta.",
    "price": 35
  },
  {
    "id": "b12",
    "image": "images/hereticaesthetics.jpg",
    "category": "painting",
    "title": "Heretical Aesthetics: Pasolini on Painting",
    "author": "Pier Paolo Pasolini",
    "description": "First collection on filmmaker and poet Pasolini's passion for painting.\n\nOne of Europe's most mythologized Marxist intellectuals of the 20th century, Pier Paolo Pasolini was not only a poet, filmmaker, novelist, and political martyr. He was also a keen critic of painting. An intermittently practicing artist in his own right, Pasolini studied under the distinguished art historian Roberto Longhi, whose lessons marked a life-long affinity for figurative painting and its centrality to a particular cinematic sensibility.\n\nPasolini set out wilfully to \"contaminate\" art criticism with semiotics, dialectology, and film theory, penning catalogue essays and exhibition reviews alongside poems, autobiographical meditations, and public lectures on painting. His fiercely idiosyncratic blend of Communism and classicism, localism and civic universalism, iconophilia and aesthetic \"heresy,\" animated and antagonized Cold War culture like few European contemporaries. This book offers numerous texts previously available only in Italian, each accompanied by an editorial note elucidating its place in the tumultuous context of post-war Italian culture.\n\nPrefaced by the renowned art historian T.J. Clark, a historical essay on Pasolini's radical aesthetics anchors the anthology. One hundred years after his birth, *Heretical Aesthetics* sheds light on one of the most consequential aspects of Pasolini's intellectual life, further illuminating a vast cinematic and poetic corpus along the way.",
    "price": 25
  },
  {
    "id": "b13",
    "image": "images/aneventperhaps.jpg",
    "category": "philosophy",
    "title": "An Event, Perhaps: A Biography of Jacques Derrida",
    "author": "Peter Salmon",
    "description": "Philosopher, film star, father of 'post truth': the real story of Jacques Derrida.\n\nWho was Jacques Derrida? For some, he is responsible, at least in part, for the contemporary crisis of truth. For the far right, he is one of the architects of Cultural Marxism. To his academic critics, he reduced French philosophy to ‘little more than an object of ridicule’. For his fans, he is an intellectual rock star who ranged across literature, politics, and linguistics. \n\nIn *An Event Perhaps*, Peter Salmon presents this misunderstood and misappropriated figure as a deeply humane and urgent thinker for our times. Accessible, provocative, and beautifully written, this biography will introduce a new readership to the life and work of a philosopher whose influence over the way we think will continue long into the twenty-first century.",
    "price": 20
  },
  {
    "id": "b14",
    "image": "images/essayscriticalandclinical.jpg",
    "category": "philosophy",
    "title": "Essays Critical and Clinical",
    "author": "Gilles Deleuze",
    "description": "This collection of essays testifies to Deleuze's fundamental conviction that philosophy cannot be undertaken independently of science and art. Deleuze's long-term ambition is realized with this book: to dismantle the barriers between art and its adjacent domains.\n\n“Authors, if they are great, are more like doctors than patients: they are themselves astonishing diagnosticians or symptomatologists.” So wrote the philosopher Gilles Deleuze, setting himself the task of demonstrating the connections between literature and medicine.\n\nThe essays collected here testify to Deleuze’s fundamental conviction that philosophy cannot be undertaken independently of science and art. As so often in his writing, the names of philosophers such as Plato, Spinoza, Kant, Nietzsche, and Heidegger appear beside those of literary figures including Melville, Whitman, D.H. Lawrence, Beckett, and Artaud. With this book, Deleuze’s life-long ambition to dismantle the barriers between art and its adjacent domains is brilliantly realized.",
    "price": 20
  },
  {
    "id": "b15",
    "image": "images/ethics.jpg",
    "category": "philosophy",
    "title": "Ethics: An Essay on the Understanding of Evil",
    "author": "Alain Badiou",
    "description": "One of the most powerful voices in contemporary French philosophy explodes the facile assumptions behind the recent ethical turn.\n\nEthical questions dominate current political and academic agendas. While government think-tanks ponder the dilemmas of bio-ethics, medical ethics, and professional ethics, respect for human rights and reverence for the Other have become matters of broad consensus.\n\nAlain Badiou, one of the most powerful voices in contemporary French philosophy, explodes the facile assumptions behind this recent ethical turn. He shows how our prevailing ethical principles serve ultimately to reinforce an ideology of the status quo and fail to provide a framework for an effective understanding of the concept of evil.\n\nIn contrast, Badiou summons up an “ethic of truths,” which is designed both to sustain and inspire a disciplined, subjective adherence to a militant cause (be it political or scientific, artistic or romantic) and to discern a finely demarcated zone of application for the concept of evil. He defends an effectively super-human integrity over the respect for merely human rights, asserts a partisan universality over the negotiation of merely particular interests, and appeals to an “immortal” value beyond the protection of mortal privileges.",
    "price": 23
  },
  {
    "id": "b16",
    "image": "images/fivelessonsonwagner.jpg",
    "category": "philosophy",
    "title": "Five Lessons on Wagner",
    "author": "Alain Badiou",
    "description": "A leading radical intellectual tackles the many controversial interpretations of Wagner’s work.\n\nFor over a century, Richard Wagner’s music has been the subject of intense debate among philosophers, many of whom have attacked its ideological—some say racist and reactionary—underpinnings. In this major new work, Alain Badiou, radical philosopher and keen Wagner enthusiast, offers a detailed reading of the critical responses to the composer’s work, which include Adorno’s writings on the composer and Wagner’s recuperation by Nazism, as well as more recent readings by Philippe Lacoue-Labarthe and others. \n\nSlavoj Žižek provides an afterword, and both philosophers make a passionate case for re-examining the relevance of Wagner to the contemporary world.",
    "price": 30
  },
  {
    "id": "b17",
    "image": "images/georgesbataille.jpg",
    "category": "philosophy",
    "title": "Georges Bataille: An Intellectual Biography",
    "author": "Michel Surya",
    "description": "An authoritative account of the life and work of Bataillen\n\nGeorges Bataille was a philosopher, writer, librarian, pornographer and a founder of the influential journals Critique and Acéphale. He has had an enormous impact on contemporary thought, influencing such writers as Barthes, Baudrillard, Derrida, Foucault and Sontag. Many of his books, including the notorious Story of the Eye and the fascinating The Accursed Share, are modern classics. \nIn this acclaimed intellectual biography, Michel Surya gives a detailed and insightful account of Bataille’s work against the backdrop of his life – his troubled childhood, his difficult relationship with André Breton and the surrealists and his curious position as a thinker of excess, ‘potlatch’, sexual extremes and religious sacrifice, one who nonetheless remains at the heart of twentieth century French thought—all of it drawn here in rich and allusive prose. While exploring the source of the violent eroticism that laces Bataille’s novels, the book is also an acute guide to the development of Bataille’s philosophical thought. Enriched by testimonies from Bataille’s closest acquaintances and revealing the context in which he worked, Surya sheds light on a figure Foucault described as ‘one of the most important writers of the century’.",
    "price": 20
  },
  {
    "id": "b18",
    "image": "images/powerandresistance.jpg",
    "category": "philosophy",
    "title": "Power and Resistance: Foucault, Deleuze, Derrida, Althusser",
    "author": "Yoshiyuki Sato",
    "description": "Power and Resistance proposes a provocative reinterpretation of “(post-)structuralist” theory of power, depending on and criticising psychoanalytic theory\n\nThe 'structuralist' theories of power show that the subject is produced and reproduced by the investment of power: but how then can we think of the subject's resistance to power? Based on this fundamental question, Power and Resistance interprets critically the (post-)structuralist theory of power and resistance, i.e., the theories of Foucault, Deleuze/Guattari, Derrida and Althusser. It analyses also the mechanism of power and the strategies of resistance in the era of neoliberalism. This meticulous analysis that completely renewed the theory of power is already published in French, Japanese, and Korean with success.",
    "price": 30
  },
  {
    "id": "b19",
    "image": "images/theabsenceofmyth.jpg",
    "category": "philosophy",
    "title": "The Absence of Myth: Writings on Surrealism",
    "author": "Georges Bataille",
    "description": "One of the most provocative and controversial writers of his time, these essays comprise Georges Bataille’s most incisive study of surrealism.\n\nFor Bataille, the absence of myth had itself become the myth of the modern age. In a world that had lost the secret of its cohesion, Bataille saw surrealism as both a symptom and a beginning of an attempt to address this loss. His writings on this theme are the result of a profound reflection in the wake of World War Two.\n\nThe Absence of Myth is the most incisive study yet made of surrealism, insisting on its importance as a cultural and social phenomenon with far-reaching consequences. Clarifying Bataille’s links with the surrealist movement and shedding light on his complex and often misunderstood relationship with André Breton, *The Absence of Myth* presents Bataille as a radical thinker. He continually sought to expand Marxist social theory and, while pessimistic, remained far removed from nihilism.",
    "price": 25
  },
  {
    "id": "b20",
    "image": "images/thefreudscenario.jpg",
    "category": "philosophy",
    "title": "The Freud Scenario",
    "author": "Jean-Paul Sartre",
    "description": "In 1958, the US director John Huston asked Jean-Paul Sartre to write a scenario for a film about Sigmund Freud. Huston wanted Sartre to focus on the conflict-ridden period of Freud’s life when he abandoned hypnosis and developed psychoanalysis. *The Freud Scenario*, discovered in Sartre’s papers after his death, is the result—a deft portrait of a man engaged in a personal and intellectual struggle that would become a turning point in twentieth-century thought.\n\nSartre did not view this script as a mere diversion from his larger intellectual project. Freud’s preoccupations with female hysteria and the father relationship intersected with major themes in Sartre’s own work. *Loser Wins*, *The Family Idiot*, and *Words*, some of Sartre’s most celebrated publications, all bear traces of his engagement with Freud’s ideas.\n\nWritten for a Hollywood audience, *The Freud Scenario* reveals that, beyond his towering intellect, Sartre possessed a genuine popular touch. Already widely acclaimed in France, this work stands as a valuable testament to two of the most influential minds in modern history.",
    "price": 23
  },
  {
    "id": "b21",
    "image": "images/theoriginofthefamilyprivatepropertyandthestate.jpg",
    "category": "philosophy",
    "title": "The Origin of the Family, Private Property and the State",
    "author": "Friedrich Engels",
    "description": "The most influential theory of the origins of women’s oppression in the modern era, now presented in a beautiful new edition.\n\nIn this provocative and now-classic work, Friedrich Engels explores the interwoven development of the family and the state from ancient society to the Victorian era. Drawing on contemporary anthropological theories, Engels argued that matriarchal communal societies were overthrown by class-based societies that prioritized private property and monogamous relationships over communal living and polygamy. This transformation, he claimed, marked “the world-historic defeat of the female sex.”\n\nA masterful application of materialist thought to history and anthropology, this landmark work examines love, monogamy, property, and human development. *The Origin of the Family, Private Property and the State* remains foundational in Marxist and socialist feminist theory, continuing to shape discussions on gender and social structures today.",
    "price": 20
  },
  {
    "id": "b22",
    "image": "images/understandingbrecht.jpg",
    "category": "philosophy",
    "title": "Understanding Brecht",
    "author": "Walter Benjamin",
    "description": "The relationship between philosopher-critic Walter Benjamin and playwright-poet Bertolt Brecht was both a lasting friendship and a powerful intellectual partnership. Meeting in late 1920s Germany, Benjamin and Brecht—both independently minded Marxists—shared a deep understanding of and commitment to the emancipatory potential of cultural practices. As the Nazi subversion of the Weimar Republic and the Stalinist degeneration of the Russian Revolution unfolded, both thinkers sought to preserve the tradition of dialectical critique and radical artistic intervention.\n\n*Understanding Brecht* brings together Benjamin’s most sensitive and probing writings on Brecht’s dramatic and poetic works. Engaging with Brecht’s theoretical innovations—such as the famous ‘estrangement effect’—Benjamin developed his own ideas about art’s role in a crisis-ridden society. This volume features Benjamin’s introductions to Brecht’s epic theatre, close textual analyses of twelve of Brecht’s poems (translated here), and discussions of key plays such as *The Mother*, *Terror and Misery of the Third Reich*, and *The Threepenny Opera*.\n\nAlso included is Benjamin’s seminal essay “The Author as Producer” and an extract from his diaries, documenting the profound conversations he and Brecht held in 1930s Denmark—discussing topics as varied as Franz Kafka’s work, the Soviet Trials, and literature’s place in a world on the brink of war. This collection offers essential insight into the artistic and intellectual dialogue between two of the most influential cultural theorists of the twentieth century.",
    "price": 20
  },
  {
    "id": "b23",
    "image": "images/whatisphilosophy.jpg",
    "category": "philosophy",
    "title": "What is Philosophy?",
    "author": "Gilles Deleuze and Félix Guattari",
    "description": "“The question ‘what is philosophy?’ can perhaps only be posed late in life, with the arrival of old age and the time for speaking concretely. It is a question posed in a moment of quiet restlessness, at midnight, when there is no longer anything to ask.”\n\nIn *What is Philosophy?*, Deleuze and Guattari come together for the final time, distilling their decades of radical thought into a profound meditation on the nature of philosophy. Twenty years after their groundbreaking *Anti-Oedipus*, they have lost none of their inspirational force—only deepened it. This book is both an exploration of what it means to be a ‘friend of wisdom’ and a scathing critique of contemporary intellectual stagnation, where “the only events are exhibitions and the only concepts are products to be sold.”\n\nPhilosophy, they insist, is not contemplation, reflection, or communication, but the *creation of concepts*. The first part of the book examines the nature of the concept, the ‘plane of immanence’ where it emerges, and the ‘conceptual personae’ who give it life. It concludes with a sweeping analysis of philosophy’s entanglement with social and economic structures, from ancient Greece to modern capitalism. The second part contrasts philosophy with its ‘rivals’—science, art, literature, and music—offering dazzling insights into figures like Gödel, Proust, Pessoa, Mondrian, and Boulez.\n\nWritten with the energy and inventiveness that marked their earlier collaborations, *What is Philosophy?* is an essential work—not just for philosophers but for anyone invested in the uses of human intelligence in an age where, as the authors remark, sales promotion has replaced critique.",
    "price": 20
  },
  {
    "id": "b24",
    "image": "images/whatissubectivity.jpg",
    "category": "philosophy",
    "title": "What Is Subjectivity?",
    "author": "Jean-Paul Sartre",
    "description": "Jean-Paul Sartre, at the height of his powers, debates with Italy’s leading intellectuals\n\nIn 1961, the prolific French intellectual Jean-Paul Sartre was invited to give a talk at the Gramsci Institute in Rome. In attendance were some of Italy’s leading Marxist thinkers, such as Enzo Paci, Cesare Luporini, and Galvano Della Volpe, whose contributions to the long and remarkable discussion that followed are collected in this volume, along with the lecture itself. Sartre posed the question “What is subjectivity?” – a question of renewed importance today to contemporary debates concerning “the subject” in critical theory. This work includes a preface by Michel Kail and Raoul Kirchmayr and an afterword by Fredric Jameson, who makes a rousing case for the continued importance of Sartre’s philosophy.",
    "price": 23
  },
  {
    "id": "b25",
    "image": "images/thefutureoftheimage.jpg",
    "category": "photography",
    "title": "The Future of the Image",
    "author": "Jacques Rancière",
    "description": "A leading philosopher presents a radical manifesto for the future of art and film\n\nIn The Future of the Image, Jacques Rancière develops a fascinating new concept of the image in contemporary art, showing how art and politics have always been intrinsically intertwined. He argues that there is a stark political choice in art: it can either reinforce a radical democracy or create a new reactionary mysticism. For Rancière there is never a pure art: the aesthetic revolution must always embrace egalitarian ideals.",
    "price": 20
  },
  {
    "id": "b26",
    "image": "images/disobey.jpg",
    "category": "society",
    "title": "Disobey!: A Philosophy of Resistance",
    "author": "Frédéric Gros",
    "description": "The world is out of joint, so much so that disobeying should be an urgent act for everyone. In this provocative essay, Frédéric Gros explores the roots of political obedience, social conformity, economic subjection, respect for authorities, constitutional consensus. Examining the various styles of obedience provides tools to study, invent and induce new forms of civic disobedience and lyrical protest. Nothing can be taken for granted: neither supposed certainties nor social conventions, economic injustice or moral conviction. Thinking philosophically requires us to never accept truths and generalities that seem obvious—it restores a sense of political responsibility. At a time when the decisions of experts are presented as the result of icy statistics and anonymous calculations, disobeying becomes an assertion of humanity. To philosophise is to disobey. This book is a call for critical democracy and ethical resistance.",
    "price": 20
  },
  {
    "id": "b27",
    "image": "images/diyculture.jpg",
    "category": "society",
    "title": "DiY Culture: Party and Protest in Nineties Britain",
    "author": "George McKay",
    "description": "“The most uplifting and empowering book you’ll read in a long time.” —Irvine Welsh\n\nCollective youth up trees or down tunnels, protest camps and all-night raves across the land—these are the spectacular features of the politics and culture of nineties youth in Britain. *DiY Culture* lays to rest the myth of “Thatcher’s children,” for the flags are flying again—green, red and black.\n\nEditor George McKay claims that popular protest today is characterized by a culture of immediacy and direct action. Gathered together here for the first time is a collection of in-depth and reflective pieces by activists and other key figures in DiY culture, telling their own stories and histories. From the environmentalist to the video activist, the raver to the road protester, the neo-pagan to the anarcho-capitalist, the authors demonstrate how the counterculture of the nineties offers a vibrant, provocative and positive alternative to institutionalized unemployment and the restricted freedoms and legislated pleasures of UK plc.",
    "price": 35
  },
  {
    "id": "b28",
    "image": "images/theassassinationoflumumba.jpg",
    "category": "society",
    "title": "The Assassination of Lumumba",
    "author": "Ludo De Witte",
    "description": "Re-issue of a classic investigation into the CIA and Belgian state plot in the Congo.\n\nThe Assassination of Lumumba unravels the appalling mass of lies, hypocrisy and betrayals that have surrounded accounts of the 1961 assassination of Patrice Lumumba—the first prime minister of the Republic of Congo and a pioneer of African unity—since it perpetration. Making use of a huge array of official sources as well as personal testimony from many of those in the Congo at the time, Ludo De Witte reveals a network of complicity ranging from the Belgian government to the CIA. Patrice Lumumba’s personal strength and his quest for African unity emerges in stark contrast with one of the murkiest episodes in twentieth-century politics.",
    "price": 27
  },
  {
    "id": "b29",
    "image": "images/thecommuneform.jpg",
    "category": "society",
    "title": "The Commune Form: The Transformation of Everyday Life",
    "author": "Kristin Ross",
    "description": "What is the Commune? A leading radical historian looks at the global resurgence of the commune and asks how they can become sites of liberation.\n\nWhen the state recedes, the commune-form flourishes. This was as true in Paris in 1871 as it is now whenever ordinary people begin to manage their daily lives collectively.\n\nRural struggles of the 1960s and 70s, like the 'Nantes Commune,' the Larzac, and Sanrizuka in Japan, appear now as the defining battles of our era. In the defense of threatened territories against all manners of privatization, hoarding, and infrastructures of disaster, new ways of producing and inhabiting are devised that side-step the state and that give rise to unprecedented kinds of solidarity built on pleasurable, fruitful collaborations. These are the crucial elements in the present-day reworking of an archaic form: the commune-form that Marx once called 'the political form of social emancipation,' and that Kropotkin deemed 'the necessary setting for revolution and the means of bringing it about.'",
    "price": 20
  },
  {
    "id": "b30",
    "image": "images/theconceptoftheform.jpg",
    "category": "society",
    "title": "The Concept of the Social: Scepticism, Idleness and Utopia",
    "author": "Malcolm Bull",
    "description": "From here to utopia. New directions in political theory\n\nWhat does political agency mean for those who don’t know what to do or can’t be bothered to do it? This book develops a novel account of collective emancipation in which freedom is achieved not through knowledge and action but via doubt and inertia.\n\nIn essays that range from ancient Greece to the end of the Anthropocene, Bull addresses questions central to contemporary political theory in novel readings of texts by Aristotle, Machiavelli, Marx, and Arendt, and shows how classic philosophical problems have a bearing on issues like political protest and climate change. The result is an entirely original account of political agency for the twenty-first century in which uncertainty and idleness are limned with utopian promise.",
    "price": 26
  },
  {
    "id": "b31",
    "image": "images/themanwhoclosedtheasylums.jpg",
    "category": "society",
    "title": "The Man Who Closed the Asylums:Franco Basaglia and the Revolution in Mental Health Care",
    "author": "John Foot",
    "description": "In 1961, when Franco Basaglia arrived outside the grim walls of the Gorizia asylum, on the Italian border with Yugoslavia, it was a place of horror, a Bedlam for the mentally sick and excluded, redolent of Basaglia's own wartime experience inside a fascist gaol. Patients were frequently restrained for long periods, and therapy was largely a matter of electric and insulin shocks. The corridors stank, and for many of the interned the doors were locked for life. This was a concentration camp, not a hospital.\n\nBasaglia, the new Director, was expected to practise all the skills of oppression in which he had been schooled, but he would have none of this. The place had to be closed down by opening it up from the inside, bringing freedom and democracy to the patients, the nurses and the psychiatrists working in that 'total institution'.\n\nInspired by the writings of authors such as Primo Levi, R. D. Laing, Erving Goffman, Michel Foucault and Frantz Fanon, and the practices of experimental therapeutic communities in the UK, Basaglia's seminal work as a psychiatrist and campaigner in Gorizia, Parma and Trieste fed into and substantially contributed to the national and international movement of 1968. In 1978 a law was passed (the 'Basaglia law') which sanctioned the closure of the entire Italian asylum system.\n\nThe first comprehensive study of this revolutionary approach to mental health care, The Man Who Closed the Asylums is a gripping account of one of the most influential movements in twentiethcentury psychiatry, which helped to transform the way we see mental illness. Basaglia's work saved countless people from a miserable existence, and his legacy persists, as an object lesson in the struggle against the brutality and ignorance that the establishment peddles to the public as common sense.",
    "price": 29.5
  },
  {
    "id": "b32",
    "image": "images/theworldisnotforsale.jpg",
    "category": "society",
    "title": "The World Is Not for Sale: Farmers Against Junk Food",
    "author": "José Bové, François Dufour and Gilles Luneau",
    "description": "In this lively and hard-hitting book Jose Bove and Francois Dufour recount the dramatic events of their famous demonstration against McDonald’s and examine the issues behind the resulting campaign, which has now stretched from France and Seattle around the world.",
    "price": 20
  },
  {
    "id": "b33",
    "image": "images/avantgardeartgroupsinchina.jpg",
    "category": "art",
    "title": "'Avant-garde' Art Groups in China, 1979-1989",
    "author": "Paul Gladston",
    "description": "This book gives a critical account of four of the most significant avant-garde Chinese art groups and associations of the late 1970s and ’80s. It is made up largely of conversations conducted by the author with members of these organizations that provide insight into the circumstances of artistic production during the decade leading up to the Tiananmen Square Massacre of 1989. The conversations are supported by an extended introduction and other comprehensive notes that give a detailed overview of the historical circumstances under which the groups and associations developed.",
    "price": 35
  },
  {
    "id": "34",
    "image": "images/girlsgirlsgirlsincontemporaryart.jpg",
    "category": "art",
    "title": "Girls! Girls! Girls! in Contemporary Art",
    "author": "Gjoko Muratovski",
    "description": "Girls! Girls! Girls! presents essays from established and up-and-coming scholars who address a variety of themes, including narcissism, nostalgia, postfeminism and fantasy with the goal of approaching the overarching question of why female artists are turning in such numbers to the subject of girls – and what these contemporary artistic explorations signify.",
    "price": 29
  },
  {
    "id": "b35",
    "image": "images/100yearsoffuturism.jpg",
    "category": "art",
    "title": "One Hundred Years of Futurism: Aesthetics, Politics and Performance",
    "author": "John London",
    "description": "More than one hundred years after Futurism exploded onto the European stage with its unique brand of art and literature, there is a need to reassess the movement, from its Italian roots to its international ramifications. The contributors to this collection examine both the original context and the cultural legacy of Futurism with fresh research.",
    "price": 40
  },
  {
    "id": "b36",
    "image": "images/punkarthistory.jpg",
    "category": "art",
    "title": "Punk Art History: Artworks from the European No Future Generation",
    "author": "Marie Arleth Skov",
    "description": "The punk movement of the 1970s to early 1980s is examined as an art movement through archive research, interviews, and art historical analysis. It is about pop, pain, poetry, presence, and about a ‘no future’ generation refusing to be the next artworld avant-garde, instead choosing to be the ‘rear-guard’. 103 col. and b/w illus.",
    "price": 36
  },
  {
    "id": "b37",
    "image": "images/timedurationandchangeincontemporaryart.jpg",
    "category": "art",
    "title": "Time, Duration and Change in Contemporary Art: Beyond the Clock",
    "author": "Kate Bretkelly-Chalmers",
    "description": "Time, Duration and Change in Contemporary Art presents a major study of time as a key aesthetic dimension of recent art practices. This book explores different aspects of time across a broad range of artistic media and draws on recent movements in philosophy, science and technology to show how artists generate temporal experiences that resist the standardized time of modernity: Olafur Eliasson's melting icebergs produce fragile temporal ecologies; Marina Abramović's performances test the durations of the human body; Christian Marclay's The Clock conflates past and present chronologies. This book examines alternative frameworks of time, duration and change in prominent philosophical, scientific and technological traditions, including physics, psychology, phenomenology, neuroscience, media theory and selected environmental sciences. It suggests that art makes a crucial contribution to these discourses not by 'visualizing' time, but by entangling viewers in different sensory, material and imaginary temporalities.",
    "price": 94.50
  },
  {
    "id": "b38",
    "image": "images/andreitarkovskyivanschildhood.jpg",
    "category": "film",
    "title": "Andrei Tarkovsky: 'Ivan's Childhood'",
    "author": "Robert Efird",
    "description": "Andrei Tarkovsky’s 1962 Ivan’s Childhood marked a pivotal moment for Soviet ‘poetic cinema’ and launched the career of an artist now considered a towering figure of Russian culture. A thorough analysis of this debut film through a close examination of the narrative structure, stylistic approach and philosophical underpinnings 25 b/w film stills.",
    "price": 30
  },
  {
    "id": "b39",
    "image": "images/davidcronenberg.jpg",
    "category": "film",
    "title": "David Cronenberg: Author or Filmmaker?",
    "author": "Mark Browning",
    "description": "For more than thirty years, David Cronenberg has made independent films such as Scanners and A History of Violence which aim to disturb, surprise, and challenge audiences. He has also repeatedly drawn on literary fiction for inspiration, adapting themes from authors like William Burroughs, J. G. Ballard, and Patrick McGrath for the big screen; David Cronenberg: Author or Filmmaker? is the first book to explore how underground and mainstream fiction have influenced—and can help illuminate—his labyrinthine films.\nFilm scholar Mark Browning examines Cronenberg’s literary aesthetic not only in relation to his films’ obvious source material, but by comparing his movies to the writings of Vladimir Nabokov, Angela Carter, and Bret Easton Ellis. This groundbreaking volume addresses Cronenberg’s narrative structures and his unique conception of auteurism, as well as his films’ shocking psychological frameworks, all in the broader context of film adaptation studies. David Cronenberg is an essential read for anyone interested in the symbiotic relationship between literature and filmmaking.",
    "price": 35
  },
  {
    "id": "b40",
    "image": "images/deleuzeandfilmmusic.jpg",
    "category": "film",
    "title": "Deleuze and Film Music: Building a Methodological Bridge between Film Theory and Music",
    "author": "Gregg Redner",
    "description": "The analysis of film music is emerging as one of the fastest-growing areas of interest in film studies. Yet scholarship in this up-and-coming field has been beset by the lack of a common language and methodology between film and music theory. Drawing on the philosophy of Gilles Deleuze, film studies scholar Gregg Redner provides a much-needed analysis of the problem which then forms the basis of his exploration of the function of the film score and its relation to film's other elements. Not just a groundbreaking examination of persistent difficulties in this new area of study, Deleuze and Film Music also offers a solution—a methodological bridge—that will take film music analysis to a new level.",
    "price": 35
  },
  {
    "id": "b41",
    "image": "images/europeanidentityincinema.jpg",
    "category": "film",
    "title": "European Identity in Cinema",
    "author": "Wendy Everett",
    "description": "The identity of European cinema, like the identity of Europe itself, is multiple, complex, and fascinating. Providing both a general survey of contemporary European cinema production, distribution and exhibition and detailed critical analysis of specific films, directors, and national cinemas, this volume offers a stimulating and thought-provoking contribution to current film debate.\nWhile the book’s critical essays offer keen insight into the complex identities of European cinema, its combination of breadth and detail, and its interdisciplinary focus and background ensure its wider relevance to anyone interested in questions of contemporary culture and European affairs in general. Its stylistic clarity and freedom from jargon make it readable and accessible.",
    "price": 29
  },
  {
    "id": "b42",
    "image": "images/fellinisfilmsandcommercials.jpg",
    "category": "film",
    "title": "Fellini’s Films and Commercials: From Postwar to Postmodern",
    "author": "Frank Burke",
    "description": "An updated edition of renowned Fellini scholar Frank Burke’s film-by-film analysis of the famed director’s work, with a new preface and a new chapter on Fellini’s commercials. Written from a theoretical perspective, Burke explores Fellini’s movement from relatively classic filmmaking to modernist reflexivity to ‘postmodern reproduction’.",
    "price": 25
  },
  {
    "id": "b43",
    "image": "images/frommeliestonewmedia.jpg",
    "category": "film",
    "title": "From Méliès to New Media: Spectral Projections",
    "author": "Wendy Haslem",
    "description": "From Méliès to New Media is an exploration of the presence and importance of film history in digital culture. The author demonstrates that new media forms are not only indebted to, but firmly embedded within the traditions and conventions of early film culture. ",
    "price": 34
  },
  {
    "id": "b44",
    "image": "images/inclusioninnewdanishcinema.jpg",
    "category": "film",
    "title": "Inclusion in New Danish Cinema: Sexuality and Transnational Belonging",
    "author": "Meryl Shriver-Rice",
    "description": "Often recognized as one of the happiest countries in the world, Denmark, like its Scandinavian neighbors, is known for its progressive culture, which is also reflected in its national cinema. It is not surprising, then, that Danish film boasts as many successful women film directors as men, uses scripts that are often cowritten by the director and the screenwriter, and produces one of the largest numbers of queer films directed by and starring women. Despite all this, Danish film is not widely written about, especially in English. Inclusion in New Danish Cinema brings this vibrant culture to English-language audiences. Meryl Shriver-Rice argues that Denmark has demonstrated that film can reinforce cultural ethics and political values while also navigating the ongoing and mounting forces of digital communication and globalization.",
    "price": 43
  },
  {
    "id": "b45",
    "image": "images/polanskiandperception.jpg",
    "category": "film",
    "title": "Polanski and Perception: The Psychology of Seeing and the Cinema of Roman Polanski",
    "author": "Davide Caputo",
    "description": "Polanski and Perception focuses on Roman Polanski's interest in the nature of perception and how this is manifested in his films. Informed by the work of neuropsychologist R. L. Gregory, this volume primarily focuses on two sets of films: the Apartment trilogy and the Investigation trilogy. This book also includes case studies of other films.",
    "price": 35
  },
  {
    "id": "b46",
    "image": "images/stanleykubrickatlookmagazine.jpg",
    "category": "film",
    "title": "Stanley Kubrick at Look Magazine",
    "author": "Philippe D. Mather",
    "description": "Beautifully written and exhaustively researched, Stanley Kubrick at Look Magazine features never-before-published photographs from the Look archives and complete scans of Kubrick’s photo essays from hard-to-obtain back issues of the magazine. It will be an indispensable addition to the libraries of Kubrick scholars and fans.",
    "price": 21
  },
  {
    "id": "b47",
    "image": "images/thedanishdirectors.jpg",
    "category": "film",
    "title": "Danish Directors",
    "author": "Ib Bondebjerg and Mette Hjort",
    "description": "This collection profiles canonized figures alongside recently-established filmmakers, featuring interviews with Lars von Trier, Thomas Vinterberg and more. It poses questions that engage with issues within film studies to stimulate debate. Each interview is preceded by the director’s photograph, biographical information and filmography.",
    "price": 22
  },
  {
    "id": "b48",
    "image": "images/themultisensoryfilmexperience.jpg",
    "category": "film",
    "title": "The Multisensory Film Experience: A Cognitive Model of Experiental Film Aesthetics",
    "author": "Luis Rocha Antunes",
    "description": " When the lights dim in a movie theatre and the projector begins to click and whir, the light and sounds of the motion picture become the gateway to a multisensory experience. Moving beyond the oft-discussed perceptual elements of vision and hearing, The Multisensory Film Experience analyses temperature, pain and balance in order to argue that it is the experience of film that's inherently multisensory, not the medium. Luis Rocha Antunes here explores the work of well-loved filmmakers Erik Jensen, Gus Van Sant and Ki-Duk Kim to offer new insights into how viewers experience films and understand their stories. This is an original contribution to an emerging field of research and will become essential reading for film scholars.",
    "price": 40
  },
  {
    "id": "b49",
    "image": "images/thereturnoftwinpeaks.jpg",
    "category": "film",
    "title": "The Return of Twin Peaks: Squaring the Circle",
    "author": "Franck Boulègue",
    "description": "Franck Boulègue's latest book about David Lynch and Mark Frost's famous television series focuses on the eighteen new episodes directed by Lynch for season 3, screened in 2017. Analyses the season with special importance given to readings from an intertextual, ontological and spiritual perspectives. Now in paperback and with 81 colour illus.",
    "price": 36
  },
  {
    "id": "b50",
    "image": "images/twinpeaks.jpg",
    "category": "film",
    "title": "Twin Peaks: Unwrapping the Plastic",
    "author": "Franck Boulègue",
    "description": "Few contemporary television shows have been subjected to the critical scrutiny that has been brought to bear on David Lynch and Mark Frost's Twin Peaks since its debut in 1990. Yet the series, and the subsequent film, Fire Walk With Me, are sufficiently rich that it's always possible for a close analysis to offer something new – and that's what Franck Boulègue has done with Twin Peaks: Unwrapping the Plastic.",
    "price": 30
  },
  {
    "id": "b51",
    "image": "images/understandingkubrics2001aspaceodyssey.jpg",
    "category": "film",
    "title": "Understanding Kubrick's 2001: A Space Odyssey: Representation and Interpretation",
    "author": "James Fenwick",
    "description": "An exploration of Stanley Kubrick’s 2001: A Space Odyssey that combines ‘new’ empirical approaches with ‘old’ formalist approaches. This provides a broader understanding of how Kubrick’s methods as a director and auteur were developed to produce a unique aesthetic creation that is still years ahead in its design, vision and philosophical structure.",
    "price": 26
  },
  {
    "id": "b52",
    "image": "images/connectingmetaltoculture.jpg",
    "category": "music",
    "title": "Connecting Metal to Culture: Unity in Disparity",
    "author": "Mika Elovaara and Bryan Bardine",
    "description": "Though it's given little attention – and even less serious attention – by the mainstream press, metal music has for decades been a major creative and cultural force around the world. This book brings together a group of contributors from Europe, North America and the Caribbean to make a case for metal's place not merely on the periphery of our culture, but at its very heart. Contributors attend not merely to the music, but also to the accompanying culture, and they offer intriguing insights into the rise of metal in places where it's traditionally been little known, like the Middle East and North Africa. The result is a global portrait of metal that asserts its importance and its ongoing contribution to culture.",
    "price": 53
  },
  {
    "id": "b53",
    "image": "images/insearchoftitospunks.jpg",
    "category": "music",
    "title": "In Search of Tito’s Punks: On the Road in a Country That No Longer Exists",
    "author": "Barry Phillips",
    "description": "An unvarnished but also affectionate portrait of Yugoslavia in the years before its demise through to the present, seen through the unlikely lens of punk and punk rockers. Part travelogue, part history the book is both, and neither, of those things. A mural and soundtrack of a journey through a time and place which no longer exists. 31 b/w illus.",
    "price": 36
  },
  {
    "id": "b54",
    "image": "images/livingmetal.jpg",
    "category": "music",
    "title": "Living Metal: Metal Scenes around the World",
    "author": "Bryan Bardine and Jerome Stueart",
    "description": "This collection of thirteen essays is an exploration of metal scenes throughout the world, from Dayton to Hull, from Copenhagen to Osaka. Unique portrayal of how these scenes developed, are experienced by fans, and are influenced by the contexts in which they are embedded. Foreword by Henkka Seppälä. 36 b&w illus.",
    "price": 30
  },
  {
    "id": "b55",
    "image": "images/nostalgiaandvideogamemusic.jpg",
    "category": "music",
    "title": "Nostalgia and Videogame Music",
    "author": "Vincent E. Rone, Can Aksoy and Sarah Pozderac-Chenevey",
    "description": "This collection of essays addresses the fascinating intersection between nostalgia and videogame music. From Nintendo to PlayStation, Zelda to Bioshock, and cult to classic games – this anthology takes readers on a musical journey into personal, historical and virtual pasts. 15 b/w illus.",
    "price": 36
  },
  {
    "id": "b56",
    "image": "images/theartofnickcave.jpg",
    "category": "music",
    "title": "The Art of Nick Cave",
    "author": "John H. Baker",
    "description": "Illuminating the remarkable scope of Nick Cave's achievements, this collection of essays explores his career as a composer of film scores, scriptwriter, and performer, his work in theatre and his literary output. Together, the resulting volume provides a lucid overview of Nick Cave's work that will orient students and fans while offering fresh insights to expert perspectives.",
    "price": 35
  },
  {
    "id": "b57",
    "image": "images/throbbinggristle.jpg",
    "category": "music",
    "title": "Throbbing Gristle: An Endless Discontent",
    "author": "Ian Trowell",
    "description": "This book situates the British band Throbbing Gristle as both a lens and critical tool for England during the punk years and the Winter of Discontent. Using detailed archival research and testimony from key performances, it plots the impact and affective reach of the band. 20 b/w illus.",
    "price": 36
  },
  {
    "id": "b58",
    "image": "images/consumerculture.jpg",
    "category": "society",
    "title": "Consumer Culture: Selected Essays",
    "author": "Gjoko Muratovski",
    "description": "We live in a society that defines us by what we consume and how. Every day we make purchasing decisions that express our sense of belonging, our commitments to the environment and our systems of belief. We often choose to buy things, not necessarily because we need them, but because we believe that these things will help us express who we are – in our own eyes and in the eyes of others. Whether we like it or not, consumerism is the prevalent ideology of our time. Led by Gjoko Muratovski who has long been influential at the intersection of design and business, Consumer Culture is the ideal starting point for an investigation into the social construction of the global economy.",
    "price": 53
  }
]
